УТ/src/InformationRegisters/CRM_ПотокиДоставкиПочты/CRM_ПотокиДоставкиПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ПотокиДоставкиПочты</name>
  <resources>
    <name>НомерПотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_ПотокиДоставкиПочты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет обработку данных для перехода на новую версию.
//
// Параметры:
//  Параметры	 - Структура	 - Параметры.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Истина;
	
	РегистрыСведений.CRM_ПотокиДоставкиПочты.ЗаполнитьПоУмолчанию();
	
КонецПроцедуры

// Процедура выполняет заполнение по умолчанию.
//
Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УчетныеЗаписи.Ссылка КАК УчетнаяЗапись,
	|	0 КАК НомерПотока
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ПотокиДоставкиПочты КАК ПотокиДоставкиПочты
	|		ПО (ПотокиДоставкиПочты.УчетнаяЗапись = УчетныеЗаписи.Ссылка)
	|ГДЕ
	|	ПотокиДоставкиПочты.УчетнаяЗапись ЕСТЬ NULL");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.CRM_ПотокиДоставкиПочты.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
